In [1]:
import numpy as np
import pandas as pd
data = pd.read_csv('/home/hari/Downloads/studentz.csv')
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

1

1 ). Find out how many males and females participated in the test

In [2]:
data.gender.value_counts()

female    518
male      482
Name: gender, dtype: int64

2

2).What do you think about the students' parental level of education?

In [12]:
data['parental level of education'].value_counts().to_frame()

                    parental level of education
some college                                226
associate's degree                          222
high school                                 196
some high school                            179
bachelor's degree                           118
master's degree                              59

3

3A).Who scores the most on average for math, reading and writing based on Gender

In [6]:
data1 = data[['gender', 'math score', 'reading score', 'writing score']].groupby('gender').mean()
data1

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

3 B ) .Who scores the most on average for math, reading and writing based on course

In [7]:
data2= data[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').mean()
data2

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

4

4 A) what do you think about the scoring variation for math, reading and writing based on Gender

In [15]:
gender= data[['gender', 'math score', 'reading score', 'writing score']].groupby('gender').std()
gender

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

4 B) what do you think about the scoring variation for math, reading and writing based on course

In [17]:
course= data[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').std()
course

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

5

5) .The management needs your help to give bonus points to the top 25% students based on their math score, so how will you help the management to achieve this

In [18]:
data.nlargest(250, ['math score'])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62

This is the list of 250 students who are eligible for bonus points